INSERT INTO authors (last_name, first_name, middle_name) VALUES
    ('Пушкин', 'Александр', 'Сергеевич'),
    ('Толстой', 'Лев', 'Николаевич'),
    ('Достоевский', 'Фёдор', 'Михайлович'),
    ('Пелевин', 'Виктор', 'Олегович'),
    ('Акунин', 'Борис', NULL);

INSERT INTO books (title) VALUES
    ('Евгений Онегин'),
    ('Война и мир'),
    ('Преступление и наказание'),
    ('Generation "П"'),
    ('Азазель');

INSERT INTO authorship (book_id, author_id, seq_num) VALUES
    (1, 1, 1),
    (2, 2, 1),
    (3, 3, 1),
    (4, 4, 1),
    (5, 5, 1);

INSERT INTO operations (book_id, qty_change, date_created) VALUES
    (1, 10, '2024-03-01'),
    (2, 5, '2024-03-01'),
    (3, 7, '2024-03-02'),
    (4, 3, '2024-03-02'),
    (5, 4, '2024-03-03'),
    (1, -2, '2024-03-05'),
    (2, -1, '2024-03-05'),
    (3, -3, '2024-03-06'),
    (1, -1, '2024-03-07'),
    (5, -2, '2024-03-07');
